ruby_on_rails_projects/ror_timetracking/app/controllers/entries_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 121]]
UPDATE "entries" SET "start_date" = ?, "comment" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["start_date", "2015-09-07 00:00:00.000000"], ["comment", "cogombres"], ["updated_at", "2015-09-09 15:03:38.120006"], ["id", 120]]
---
	def update
		@entry = Entry.find(params[:id])
		project = @entry.project
		if @entry.update(entry_params)

INSERT INTO "entries" ("minutes", "hours", "start_date", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["minutes", -3], ["hours", 4], ["start_date", "2015-09-18 00:00:00.000000"], ["comment", "potatoes"], ["created_at", "2015-09-09 13:21:00.013642"], ["updated_at", "2015-09-09 13:21:00.013642"]]
---
	def create
		id = params[:project_id]
		@entry = Entry.new(entry_params)
		@entry.project_id = id

		if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 136]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 136]]
---
	def destroy
		entry = Entry.find(params[:id])
		entry.destroy