ruby_on_rails_projects/ror_timetracking/app/controllers/projects_controller.rb

	def create
		@project = Project.new(project_params)
		if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Alvaro"], ["description", "I am the best"], ["created_at", "2015-09-08 08:53:28.919775"], ["updated_at", "2015-09-08 08:53:28.919775"]]

	def update
		@project = Project.find(params[:id])
		if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 47]]
UPDATE "projects" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "SDFDRG"], ["description", "SRGERGRSTH"], ["updated_at", "2015-09-10 08:37:28.288025"], ["id", 47]]

	def destroy
		project = Project.find(params[:id])
		project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 49]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 49]]

	def show
		id = params[:id]
		@project = Project.find(id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 38]]